apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# ---------------------------------------------------------------------------
# Deliberately NOT set
# ---------------------------------------------------------------------------
#
# PSRAM. Still not used for anything by default -- see the note below the
# switches, which is the one that matters.
#
# The old note here said "turn it on only with a specific allocation in mind".
# There is now exactly one: a TFLM tensor arena, which is the one buffer in this
# project that is large, touched only by a low-priority task on the other core,
# and useless to shrink. Everything that note refused is still refused.
#
# It is NOT for the ring. PSRAM is the wrong memory for a ring regardless, since
# the ring is touched from the playback path and cache misses there are the one
# thing that loop cannot absorb.
#
# It is NOT for the lead. The ring that bounds LEAD + RESYNC is the SATELLITE's,
# and the satellite is a classic ESP32 with no PSRAM at all -- so no amount of
# memory on this unit buys the lead a single millisecond. That is the whole
# answer to "the S3 has plenty of PSRAM, can we not have a 500 ms lead": a 500 ms
# lead needs ~107 kB of satellite ring against a largest free block of 106 kB,
# and it would fail to allocate on the board that has to hold it.
#
# The larger ring the wart actually wanted has since been taken, in the
# satellite's internal SRAM, where it belongs: 64 -> 80 kB, which moved the
# bound from 320 ms against 372 to 350 against 464 and let RESYNC_US go from
# 120 to 150.
#
# The octal interface eats GPIO 33-37. On the Sense this cost nothing at all --
# those pins are not broken out anywhere on that board. On the Plus it MAY cost
# something: the extra rear pads are around nine GPIOs, of which 38-42 are the
# confirmed ones, and whether 33-37 are among the rest has not been checked
# against the schematic. It is still free as this build stands, because nothing
# here uses a rear pad; check before designing anything that does.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# THE line, and the reason enabling PSRAM at all is safe here.
#
# CAPS_ALLOC means ordinary malloc() NEVER returns PSRAM. The ring, the DMA
# buffers, the frame queue and every stack stay exactly where they are, in
# internal SRAM, with exactly the timing they were measured with. PSRAM is
# reachable only by asking for it by name -- heap_caps_malloc(n,
# MALLOC_CAP_SPIRAM), which in this tree is ml_arena.c and nothing else -- or
# via the one narrow exemption below, which moves WiFi and lwIP only.
#
# This paragraph used to say the WiFi buffers stayed internal too. They do not
# any more, and the measurement that changed it is recorded below.
#
# The alternative, SPIRAM_USE_MALLOC, would let the allocator hand PSRAM to
# anything above a threshold, which is precisely the "adds cache-miss jitter to
# every task" the old note warned about. That warning was right and this setting
# is how it is respected rather than overruled.
CONFIG_SPIRAM_USE_CAPS_ALLOC=y

# Read the vis `cost:` line and the HEALTH heap figures after flipping this on,
# and compare against the numbers recorded above: analysis 3900/21000 us
# mean/max, hub min heap ~68 kB, 0 audio gaps/min over 18 min. The old note
# asked for exactly this measurement and recorded that nobody had made it on
# this part. It is still worth making -- enabling the PSRAM controller changes
# cache behaviour even when nothing allocates from it.
#
# UPDATE: the `hub min heap ~68 kB` in that paragraph is a CLASSIC-HUB figure
# and cannot be compared against this board. On the classic ESP32 there was one
# pool, so esp_get_free_heap_size() was the internal figure. Turning PSRAM on
# here silently moved that field to an 8 MB pool nothing on the audio path can
# use, and no internal figure replaced it until the MEM line existed. The first
# real internal baseline on this part, taken with that line:
#
#   MEM: internal 22056 free (min 5808, window 20676, largest 11776)
#   MEM: internal 21912 free (min 1520, window 20512, largest 11776)
#
# 1520 bytes. The hub had been running that close to the floor for as long as
# PSRAM has been on, and every figure on HEALTH said 8 MB free.

# The narrow exemption: WiFi and lwIP allocate from PSRAM first, internal second.
#
# WHY. The registered internal heap on this part is ~268 kB, not the 512 kB the
# datasheet headline suggests -- ~102 kB is DRAM shadowed by IRAM code
# (.dram0.dummy), ~96 kB is static .data/.bss, ~33 kB is ROM-reserved. Of that
# ~268 kB, ~246 kB is live: ~53 kB of task stacks and ~122 kB of this app's own
# buffers (local_ring 64 kB, the visualiser's pcm_stream 32.8 kB, the ML lane
# 12.8 kB, I2S DMA 6 kB, SPI frames 4.1 kB). What is left has to absorb WiFi's
# 32 dynamic TX and 32 dynamic RX buffers, whose transient ceiling is ~105 kB.
# It cannot, and the 1520-byte watermark above is the collision.
#
# The failure was caught in the act:
#
#   E ALLOCATION FAILED 2 time(s): largest request 1700 B (caps 0x1800 INTERNAL)
#
# and the chain to those caps is exact. With this symbol off, wifi_malloc() is
# plain malloc() (esp_wifi/esp32s3/esp_adapter.c), and heap_caps_malloc_default()
# ANDs in MALLOC_CAP_INTERNAL because CAPS_ALLOC leaves malloc_alwaysinternal_
# limit at MALLOC_DISABLE_EXTERNAL_ALLOCS -- giving DEFAULT|INTERNAL = 0x1800,
# the caps in the log. The 1700 bytes is one dynamic TX buffer.
#
# WHAT MOVES, AND WHAT DOES NOT. Only WiFi and lwIP. wifi_malloc() becomes
# heap_caps_malloc_prefer(size, 2, DEFAULT|SPIRAM, DEFAULT|INTERNAL) -- PSRAM
# first, internal fallback RETAINED, so nothing that succeeds today can start
# failing. The audio ring, the I2S DMA buffers, the frame queue and every task
# stack are untouched: the playback loop, which is the one thing that cannot
# absorb cache-miss jitter, never sees PSRAM. WiFi is both the pool that spikes
# and the one furthest from that loop, which is what makes it the right thing to
# move and the ring the wrong thing.
#
# RISK, and how to falsify it: WiFi buffers now sit behind the PSRAM cache. Read
# the vis `cost:` mean/max, `sbc_in ... max gap`, and tx-fail against a capture
# from the previous flash on the same track. If any of them move, this comes out
# -- the diagnostic half of this branch stands on its own.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

