apicov/bluetooth_speaker/hub_s3/sdkconfig.defaults
# The three below are PINNED AT THEIR CURRENT VALUES, not tuned. Enabling the
# symbol above would otherwise move all three, and this has to stay a single-
# variable experiment for the same reason the TX buffer count was returned to 32
# further up: the only question being asked here is WHERE WiFi memory comes
# from, and an answer confounded by three other changes is not an answer.
#
# STATIC_RX_BUFFER_NUM would go 10 -> 16, RX_BA_WIN 6 -> 16 (both in
# esp_wifi/Kconfig, defaulted per SPIRAM_TRY_ALLOCATE_WIFI_LWIP). The BA window
# matters on the air, not just in RAM: the satellite is built with 6, and moving
# only this end changes what the two negotiate.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=10
CONFIG_ESP_WIFI_RX_BA_WIN=6

# CACHE_TX_BUFFER_NUM only exists when the symbol above is set, and defaults to
# 32. It queues upper-layer packets in PSRAM when no static TX buffer is free,
# instead of rejecting them.
#
# WAS 0 DELIBERATELY, on two objections. "Worth trying on its own once the
# fan-out work needs it" is what the note said, and the fan-out work needs it.
#
# The first objection does not survive being checked. "A late audio packet is
# refused at anchor time anyway (ANCHOR_MIN_LEAD_US)" -- but that gate applies
# at STREAM START, not to packets inside a running stream, and the hub stamps
# play_at 200 ms ahead. A packet held a few ms in this queue still arrives with
# ~195 ms of lead and plays normally. The alternative is not a late packet, it
# is no packet: a hole in the sound on every satellite at once, recoverable from
# the FEC only if the NEXT packet gets through, which under a burst of ENOMEM is
# exactly what does not happen.
#
# The second objection stands, and is why this is BACK AT 0 after one run with
# it on: it converts tx-fail into silence, and tx-fail is the counter this whole
# file is written around.
#
# The run with it on (17:52) is the useful negative result. tx-fail did NOT go
# away -- 10 to 58 audio rejections per 20 s window with 32 cache buffers in
# front of them -- which says the constraint is AIRTIME, not buffer count. A
# queue cannot make a stream fit that does not fit; it only delays the moment it
# does not. So the queue was never going to be the fix, and leaving it on now
# would confound the thing that might be: with FEC at 0 an audio packet drops
# from the 1472-byte MTU back to ~851 B, and the question is whether tx-fail
# goes to zero because of that. It cannot be answered through a queue that
# absorbs the evidence either way.
#
# Turn it back on once tx-fail is genuinely 0 and the reason is understood. It
# is free in the pool that matters -- these live in PSRAM, of which the hub has
# 8 MB, while the static buffers are internal SRAM with ~6.7 kB free and a
# largest block of 3584, room for two more of those at most -- so it is worth
# having as burst insurance. It is not worth having as a blindfold.
CONFIG_ESP_WIFI_CACHE_TX_BUFFER_NUM=0

# Forward this unit's logs and HEALTH snapshots over the sync socket to a
# laptop collector (see CONFIG_DANCEFLOOR_WIFI_LOGS). Bench only -- off in a
# production flash, where the shipper compiles out entirely. The hub also
# relays every satellite's logs to the collector, so this is the one unit that
# must have it on for centralised capture to work.
CONFIG_DANCEFLOOR_WIFI_LOGS=y

# How many DHCP leases the SoftAP can hand out. IDF's default is 8, which was
# invisible while MAX_CLIENTS was also 8: it agreed by coincidence rather than
# by construction, and nothing named it.
#
# It is the THIRD of three limits that decide how many satellites a floor can
# hold, and the only one whose failure is quiet. The other two -- MAX_CLIENTS
# and wifi_config.ap.max_connection -- refuse a satellite at association, which
# it notices and reports. Running out of leases lets it associate and then gives
# it no address, so the hub sees a station that joined and never probed, and
# n_sta_nolease is the only tell. Kept at MAX_CLIENTS so the three move
# together.
CONFIG_LWIP_DHCPS_MAX_STATION_NUM=15

# The hub runs NO pluggable analysers, and gives up its own to buy transmit
# capacity. Pinned here because it was not pinned anywhere: the Kconfig default
# is DANCEFLOOR_ML_SOURCE_LOCAL, sdkconfig is gitignored, and so a clone of this
# repo built a hub that started the slow lane while every measurement written
# above was taken on one that did not.
#
# What it costs the hub: nothing it was using. The lane's two analysers are
# ZcrRms and Mood; the periodic log read `slow 0/0 us` and `results N+0` for the
# whole of every run captured -- the slow lane produced nothing at all -- and
# `ml-throt` showed ~77 of the fast one's results a second being computed and
# thrown away against a 100 ms publish period.
#
# What it buys: ~25 kB of INTERNAL SRAM, which is the pool the WiFi static TX
# buffers come from and the binding constraint on this board. The lane's stream
# buffer alone is 12.8 kB (16 kHz x 400 ms x 2 B), plus a 4 kB mlan stack and
# its TCB, plus ~6.3 kB of resampler table and decimation buffer that
# DF_RUNS_ANALYSERS drops with it. None of it can live in PSRAM:
# SPIRAM_USE_CAPS_ALLOC means plain malloc and every task stack are internal.
#
# The analysers stay in the shared component and stay buildable -- the intent is
# to run them on a SATELLITE, which has the audio and none of this hub's
# transmit load. Nothing in the tree compiles that path now, so
# `tools/syntax_check.py --with DANCEFLOOR_ML_SOURCE_LOCAL` is what keeps it
# from rotting.
CONFIG_DANCEFLOOR_ML_SOURCE_LOCAL=n
CONFIG_DANCEFLOOR_ML_SOURCE_REMOTE=y

# Nothing to publish once no analyser runs here, so this would send an empty
# result stream to every satellite. ~10 datagrams/s per satellite, unicast.
CONFIG_DANCEFLOOR_PUBLISH_ML=n

# Spending the SRAM the line above freed. 26 was not a tuning result, it was
# what fitted: "26, NOT 32. Each static buffer is ~1.6 kB of INTERNAL memory --
# the pool that had 7,760 bytes free -- so 32 would need 25.6 kB and only 16 kB
# was freed by taking the ring from 64 kB to 48 kB." The lane's ~25 kB is the
# rest of that arithmetic.
#
# 32 is the conservative step, not the ceiling. The pool is claimed once inside
# esp_wifi_init(), long before the heap fragments, so the steady-state `largest`
# of 3584 is not the budget -- free contiguous memory at init is. Read
# `MEM: internal ... (min N)` on a run before raising it further; min is the
# figure that survives the dip, and the one this file's own notes say to trust.
CONFIG_ESP_WIFI_STATIC_TX_BUFFER_NUM=40

# 32 -> 40 on the measurement, not on the estimate. With the lane gone the hub
# reads `MEM: internal 25032 free (min 22012, largest 13824)` against a baseline
# of `8764 free (min 6740, largest 3584)`. min is up 15.3 kB AFTER the 26 -> 32
# step had already spent ~9.6 kB of it, so the lane really did return ~24.9 kB --
# the Kconfig's "about 25 kB" to the hundred bytes.
#
# 8 more buffers is ~12.8 kB, leaving ~9 kB of min. Not all 13 that would fit:
# the pool is claimed at esp_wifi_init() and everything else on this unit
# allocates after it, so spending the margin here would move a failure rather
# than remove one. `largest` tripling to 13824 matters as much as the total --
# a 1.6 kB contiguous request now has room it did not have.
#
# This exists for the DTIM BURST, not for the average. Group-addressed frames
# leave in one burst per beacon, and 26 buffers could not hold audio plus 86
# analysis frames a second (~15 per burst); that is what took the floor down
# when DANCEFLOOR_MCAST_FRAMES was first tried. 40 is the pool that makes
# retrying it a fair question.

# UNDER TEST. Overrides the Kconfig default of n, which stays n because it is
# the right answer for a hub with the 26 static TX buffers that default implies.
# This one has 40, which is the whole point of the two settings above.
#
# The question is narrow: does a 40-buffer pool absorb a DTIM burst of ~15
# group frames, where 26 could not? Group-addressed frames are held and released
# once per beacon, so audio (~5 per burst) plus 86 analysis frames a second
# (~10 more) is what emptied the pool on 2026-08-13 -- `tx-fail 14-27 audio` per
# 20 s window and the satellite's gap rate tracking it one for one at 1.1/s.
#
# It is worth retrying because it is the only change that makes the hub's
# transmit rate FLAT in speaker count: 50 + 96xN packets/s becomes ~146,
# whatever N is. Unicast frames are affordable at two satellites and arithmetic
# says they are not at fifteen.
#
# READ tx-fail AND the satellite's gaps together, not tx-fail alone. Baseline to
# beat, from the run that measured the freed SRAM: `tx-fail 0 (0 audio)`,
# `50 pkts/s`, satellite `gaps 8` in 545 s. If tx-fail leaves zero, this goes
# back out and the answer is that the burst -- not the buffer count -- is the
# wall, and 10+ satellites needs a longer beacon interval or a smaller frame
# rather than a bigger number.
CONFIG_DANCEFLOOR_MCAST_FRAMES=y
